apache/nuttx/arch/arm/src/imxrt/imxrt_clockconfig_ver2.c
            /* Wrong input parameter pll or not implemented */

            DEBUGASSERT(false);
            break;
        }

      frac = frac >> (8 * pfd);

      if (frac != 0)
        {
          *frequency = (pllfreq / frac * 18);
        }
      else
        {
          *frequency = 0;
        }

      return OK;
    }
  else
    {
      return -ENODEV;
    }
}

/****************************************************************************
 * Name: imxrt_get_clock
 *
 * Description:
 *   This function returns the clock frequency of the specified functional
 *   clock.
 *
 * Input Parameters:
 *   clkname   - Identifies the clock of interest
 *   frequency - The location where the peripheral clock frequency will be
 *              returned
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure.  -ENODEV is returned if the clock is not enabled or is not
 *   being clocked.
 *
 ****************************************************************************/

int imxrt_get_clock(enum ccm_clock_name clkname, uint32_t *frequency)
{
  switch (clkname)
    {
      case OSC_RC_16M:
        *frequency = 16000000U;
        break;

      case OSC_RC_48M:
        *frequency = 48000000U;
        break;

      case OSC_RC_48M_DIV2:
        *frequency = 24000000U;
        break;

      case OSC_RC_400M:
        *frequency = 400000000U;
        break;

      case OSC_24M:
        *frequency = 24000000U;
        break;

      case PLL_ARM_CLK:
        return imxrt_get_pll(PLL_ARM_CLK, frequency);
        break;

      case SYS_PLL2:
        return imxrt_get_pll(SYS_PLL2, frequency);
        break;

      case SYS_PLL2_PFD0:
        return imxrt_get_pll_pfd(SYS_PLL2, 0, frequency);
        break;

      case SYS_PLL2_PFD1:
        return imxrt_get_pll_pfd(SYS_PLL2, 1, frequency);
        break;

      case SYS_PLL2_PFD2:
        return imxrt_get_pll_pfd(SYS_PLL2, 2, frequency);
        break;

      case SYS_PLL2_PFD3:
        return imxrt_get_pll_pfd(SYS_PLL2, 3, frequency);
        break;

      case SYS_PLL3:
        return imxrt_get_pll(SYS_PLL3, frequency);
        break;

      case SYS_PLL3_DIV2:
        imxrt_get_pll(SYS_PLL3, frequency);
        *frequency = *frequency / 2;
        break;

      case SYS_PLL3_PFD0:
        return imxrt_get_pll_pfd(SYS_PLL3, 0, frequency);
        break;

      case SYS_PLL3_PFD1:
        return imxrt_get_pll_pfd(SYS_PLL3, 1, frequency);
        break;

      case SYS_PLL3_PFD2:
        return imxrt_get_pll_pfd(SYS_PLL3, 2, frequency);
        break;

      case SYS_PLL3_PFD3:
        return imxrt_get_pll_pfd(SYS_PLL3, 3, frequency);
        break;

      case SYS_PLL1:
        return imxrt_get_pll(SYS_PLL1, frequency);
        break;

      case SYS_PLL1_DIV2:
        imxrt_get_pll(SYS_PLL1, frequency);
        *frequency = *frequency / 2;
        break;

      case SYS_PLL1_DIV5:
        imxrt_get_pll(SYS_PLL1, frequency);
        *frequency = *frequency / 5;
        break;

      case AUDIO_PLL_CLK:
        return imxrt_get_pll(AUDIO_PLL_CLK, frequency);
        break;
      case VIDEO_PLL_CLK:
        return imxrt_get_pll(VIDEO_PLL_CLK, frequency);
        break;

      default:

        /* Wrong input parameter name. */

        return -ENODEV;
        break;
    }

  return OK;
}

/****************************************************************************
 * Name: imxrt_get_rootclock
 *
 * Description:
 *   This function returns the clock frequency of the specified root
 *   functional clock.
 *
 * Input Parameters:
 *   clkroot   - Identifies the peripheral clock of interest
 *   frequency - The location where the peripheral clock frequency will be
 *              returned
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure.  -ENODEV is returned if the clock is not enabled or is not
 *   being clocked.
 *
 ****************************************************************************/

int imxrt_get_rootclock(uint32_t clkroot, uint32_t *frequency)
{
  uint32_t reg;
  uint32_t div;
  ccm_clock_name clk_name;

  if (clkroot <= IMXRT_CCM_CR_COUNT)
    {
      clk_name = ((g_initial_clkconfig.ccm.clock_root[clkroot].mux
                 & CLOCK_NAME_MASK) >> CLOCK_NAME_SHIFT);
      reg = getreg32(IMXRT_CCM_CR_CTRL(clkroot));

      if ((reg & CCM_CR_CTRL_OFF) == CCM_CR_CTRL_OFF)
        {
          *frequency = 0;
        }
      else
        {
          imxrt_get_clock(clk_name, frequency);
          div = ((reg & CCM_CR_CTRL_DIV_MASK) >> CCM_CR_CTRL_DIV_SHIFT) + 1;
          *frequency = *frequency / div;
        }

      return OK;
    }

  return -ENODEV;
}
